docs/posts/2025-05-01-listening-those-who-left.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- May 01, 2025 15:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Listening to Those Who Left</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<h1 class="title">Listening to Those Who Left
<br />
<span class="subtitle">May 01, 2025 15:52</span>
</h1>
<p>
It&rsquo;s important to listen to the voices of those who have left the church. Here is one of those voices:
</p>

<blockquote>
<p>
I consider myself one of those who have left the American evangelical church, unable to recognize as legitimate a belief system that doesn’t worship Jesus’ example to help the poor, the sick and the hungry. A church system that doesn’t recognize Jesus’ love and empathy, but rather worships money and power for money’s and power’s sake.
</p>
</blockquote>

<p class="source">
<a href="https://www.washingtonpost.com/opinions/2025/04/30/african-spirituality-in-sinners/?carta-url=https%3A%2F%2Fs2.washingtonpost.com%2Fcar-ln-tr%2F4257637%2F6813462add86c91e54cfe1b1%2F596a35569bbc0f0e09e8239c%2F34%2F64%2F6813462add86c91e54cfe1b1" class="source">Karen Attiah</a>
</p>

<div class="tagline" id="orgbc63ab4">
<p>
Tagged:  <a href="../tags/quotes.html">Quotes</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on May 01, 2025 15:56.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
